In [1]:
import pandas as pd 
import numpy as np

In [2]:
df = pd.DataFrame({'key1': ['a','a','b','b','a'],
'key2': ['one','two','one','two','one'],
'data1':np.random.randn(5),
'data2':np.random.randn(5)})

In [3]:
df

  key1 key2     data1     data2
0    a  one  1.900151 -0.625873
1    a  two -0.674850  1.763395
2    b  one -2.158919 -0.555862
3    b  two -0.255092  1.207908
4    a  one -1.966647 -1.312627

In [4]:
# We want to get the mean of data1 column using the labels from key

In [5]:
grouped = df['data1'].groupby(df['key1'])

In [6]:
grouped

In [7]:
grouped.mean()

key1
a   -0.247115
b   -1.207005
Name: data1, dtype: float64

In [10]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [11]:
means

key1  key2
a     one    -0.033248
      two    -0.674850
b     one    -2.158919
      two    -0.255092
Name: data1, dtype: float64

In [12]:
means.unstack()

key2       one       two
key1
a    -0.033248 -0.674850
b    -2.158919 -0.255092

In [13]:
##################################

In [21]:
states = np.array (['Ohio','California','California','Ohio','Ohio'])

In [22]:
years = np.array ([2005,2005,2006,2005,2006])

In [23]:
df['data1'].groupby([states,years]).mean()

California  2005   -0.674850
            2006   -2.158919
Ohio        2005    0.822530
            2006   -1.966647
Name: data1, dtype: float64

In [24]:
df.groupby('key1').mean()

         data1     data2
key1
a    -0.247115 -0.058368
b    -1.207005  0.326023

In [25]:
df.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one  -0.033248 -0.969250
     two  -0.674850  1.763395
b    one  -2.158919 -0.555862
     two  -0.255092  1.207908

In [26]:
# Iterating Over Groups

In [27]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  1.900151 -0.625873
1    a  two -0.674850  1.763395
4    a  one -1.966647 -1.312627
b
  key1 key2     data1     data2
2    b  one -2.158919 -0.555862
3    b  two -0.255092  1.207908

In [29]:
pieces = dict(list(df.groupby('key1')))

In [30]:
pieces

{'a':   key1 key2     data1     data2
 0    a  one  1.900151 -0.625873
 1    a  two -0.674850  1.763395
 4    a  one -1.966647 -1.312627,
 'b':   key1 key2     data1     data2
 2    b  one -2.158919 -0.555862
 3    b  two -0.255092  1.207908}

In [31]:
pieces['b']

  key1 key2     data1     data2
2    b  one -2.158919 -0.555862
3    b  two -0.255092  1.207908

In [32]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [33]:
# Selecting a Column or Subset of Columns

In [34]:
s_grouped = df.groupby(['key1','key2'])['data2']

In [35]:
s_grouped

In [36]:
s_grouped.mean()

key1  key2
a     one    -0.969250
      two     1.763395
b     one    -0.555862
      two     1.207908
Name: data2, dtype: float64

In [37]:
# Grouping with Dicts and Series

In [41]:
people = pd.DataFrame(np.random.rand(5,5),
 columns= ['a','b','c','d','e'],
 index=['Lizzi','Steve','Cris','Herve','Ioana'])

In [42]:
people.iloc[2:3,[1,2]] = np.nan # Add a dew NA values

In [43]:
people

              a         b         c         d         e
Lizzi  0.951003  0.527102  0.948362  0.380406  0.512532
Steve  0.311478  0.710129  0.441367  0.569700  0.519223
Cris   0.894143       NaN       NaN  0.498562  0.746496
Herve  0.525508  0.325289  0.703795  0.167432  0.331024
Ioana  0.476849  0.501794  0.144439  0.339092  0.399436

In [44]:
mapping = {'a':'red','b':'red','c':'blue','d':'blue','e':'red','f':'orange'}

In [45]:
by_column = people.groupby(mapping,axis=1)

In [46]:
by_column.sum()

           blue       red
Lizzi  1.328768  1.990637
Steve  1.011066  1.540830
Cris   0.498562  1.640638
Herve  0.871226  1.181822
Ioana  0.483531  1.378079

In [47]:
map_series = pd.Series(mapping)

In [48]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [49]:
people.groupby(map_series, axis=1).count()

       blue  red
Lizzi     2    3
Steve     2    3
Cris      1    2
Herve     2    3
Ioana     2    3

In [50]:
# Grouping with Functions

In [51]:
people.groupby(len).sum()

          a         b         c         d         e
4  0.894143  0.000000  0.000000  0.498562  0.746496
5  2.264839  2.064314  2.237962  1.456630  1.762215

In [52]:
key_list = ['one','one','one','two','two']

In [53]:
people.groupby([len,key_list]).min()

              a         b         c         d         e
4 one  0.894143       NaN       NaN  0.498562  0.746496
5 one  0.311478  0.527102  0.441367  0.380406  0.512532
  two  0.476849  0.325289  0.144439  0.167432  0.331024

In [54]:
# Grouping by Index Levels

In [2]:
import pandas as pd
import numpy as np

In [5]:
columns = pd.MultiIndex.from_arrays([['US','US','US','JP','JP'],
[1,3,5,1,3]],
names=['cty','tenor'])

In [6]:
hier_df = pd.DataFrame(np.random.randn(4,5), columns = columns)

In [7]:
columns

MultiIndex([('US', 1),
            ('US', 3),
            ('US', 5),
            ('JP', 1),
            ('JP', 3)],
           names=['cty', 'tenor'])

In [8]:
hier_df

cty          US                            JP
tenor         1         3         5         1         3
0     -1.080521  0.189199  0.773792 -1.009757 -1.063641
1     -0.202431  0.107592 -1.437424  1.913832 -0.059140
2     -1.611549 -1.276409  0.102217  0.431241 -0.611062
3      0.311686 -0.404137  0.652138 -0.076875 -0.731436

In [9]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3

In [10]:
# Data Aggregation

In [11]:
# Data Aggregations refer to any data transformation that produces scalar values from arrays.

In [20]:
df = pd.DataFrame({'key1':['a','a','b','b','a'], 'key2':['one','two','one','two','one'],
'data1': np.random.randn(5),
'data2': np.random.randn(5)})

In [21]:
df

  key1 key2     data1     data2
0    a  one  0.491615 -0.567121
1    a  two -0.406328  1.145830
2    b  one  0.711055 -0.072909
3    b  two -0.204560 -0.699516
4    a  one -1.433371 -1.808056

In [22]:
# we wanted to compute the mena of data1 column using the labels from Key1

In [23]:
grouped = df['data1'].groupby(df['key1'])

In [24]:
grouped

In [25]:
grouped.mean()

key1
a   -0.449361
b    0.253248
Name: data1, dtype: float64

In [26]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [27]:
means

key1  key2
a     one    -0.470878
      two    -0.406328
b     one     0.711055
      two    -0.204560
Name: data1, dtype: float64

In [28]:
means.unstack()

key2       one       two
key1
a    -0.470878 -0.406328
b     0.711055 -0.204560

In [ ]:
###############################################################

In [29]:
states = np.array(['Ohio','California','California','Ohio','Ohio'])

In [30]:
years = np.array([2005,2005,2006,2005,2006])

In [31]:
df['data1'].groupby([states,years]).mean()

California  2005   -0.406328
            2006    0.711055
Ohio        2005    0.143528
            2006   -1.433371
Name: data1, dtype: float64

In [32]:
# Iterating Over Groups

In [33]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one  0.491615 -0.567121
1    a  two -0.406328  1.145830
4    a  one -1.433371 -1.808056
b
  key1 key2     data1     data2
2    b  one  0.711055 -0.072909
3    b  two -0.204560 -0.699516

In [34]:
for (k1,k2), group in df.groupby(['key1','key2']):
    print((k1,k2))
    print(group)

('a', 'one')
  key1 key2     data1     data2
0    a  one  0.491615 -0.567121
4    a  one -1.433371 -1.808056
('a', 'two')
  key1 key2     data1    data2
1    a  two -0.406328  1.14583
('b', 'one')
  key1 key2     data1     data2
2    b  one  0.711055 -0.072909
('b', 'two')
  key1 key2    data1     data2
3    b  two -0.20456 -0.699516

In [35]:
# Filling Missing Values with Group- Specific Values

In [36]:
s = pd.Series(np.random.randn(6))

In [37]:
s

0    0.479170
1    0.013415
2    0.413588
3    0.782136
4   -1.987446
5   -0.501702
dtype: float64

In [38]:
s[::2] = np.nan

In [39]:
s

0         NaN
1    0.013415
2         NaN
3    0.782136
4         NaN
5   -0.501702
dtype: float64

In [40]:
s.fillna(s.mean())

0    0.097950
1    0.013415
2    0.097950
3    0.782136
4    0.097950
5   -0.501702
dtype: float64